import os
import re

# 输入作业路径，检查有无同学没交作业
class CheckName:
    def __init__(self):
        # 输入文件路径
        self.file_name = input("文件目录路径：")
        #所有学生的学号，用于匹配
        self.snos = ['3117004801', '3117004843', '3117004849', '3117004864',
                    '3117004865', '3117004874', '3117004880', '3117004881',
                    '3117004887', '3117004911', '3117004913', '3117004944',
                    '3117004950', '3117004968', '3117004973', '3117004974',
                    '3117004983', '3117004991', '3117004993', '3117004995',
                    '3117004997', '3117004998', '3117004999', '3117005001',
                    '3117005006', '3117005007', '3117005008', '3217004871',
                    '3217004872']
        # 对应学生的信息字典，用于输出姓名
        self.sname = {'3117004801': '骆雪天', '3117004843':'李艺', '3117004849':'马墩生',
                      '3117004864': '郑鑫涛', '3117004865': '周古楠', '3117004874': '蔡浩明',
                      '3117004880': '邓锦豪', '3117004881': '黄贞树', '3117004887': '廖健强',
                      '3117004911': '郑嘉竣', '3117004913': '周梓岖', '3117004944': '万胜峰',
                      '3117004950': '谢世豪', '3117004968': '蔡港生', '3117004973': '洪嘉伟',
                      '3117004974': '黄大海', '3117004983': '梁峻崇', '3117004991': '马东宇',
                      '3117004993': '邱焕', '3117004995': '王灿銮', '3117004997': '魏艳辉',
                      '3117004998': '温晓童', '3117004999': '伍鑫', '3117005001': '杨道潮',
                      '3117005006': '张润发', '3117005007': '张镇洲', '3117005008': '钟经谋',
                      '3217004871': '刘丹丹', '3217004872': '王昱婷'}

    def check(self):
        # 用来存储没有交作业的同学的学号
        sno_z = []
        # 寻找对应目录的文件，获取对应的文件名
        for (root, dirnames, filenames) in os.walk(self.file_name):
            for sno in self.snos:
                # 设置旗帜来标识是否匹配的到
                flag = False
                for filename in filenames:
                    if re.match(sno, filename):
                        flag = True
                        continue
                if flag==False:
                    sno_z.append(sno)

        # 打印没有交作业的学号的对应名字
        for sno in sno_z:
            print(self.sname[sno])

if __name__ == '__main__':
    c = CheckName()
    c.check()
    s = input()